In [4]:
import pandas as pd
import numpy as np

Custom Index

In [6]:
s=pd.Series([10,20,30],index=['a','b','c'])
print(s)

a    10
b    20
c    30
dtype: int64

In [7]:
print(s['a'])

10

series in dictionary

In [8]:
data={"Math":90,"Physics":85,"Chemistry":88}

In [9]:
marks=pd.Series(data)

In [10]:
print(data)

{'Math': 90, 'Physics': 85, 'Chemistry': 88}

In [11]:
print(marks)

Math         90
Physics      85
Chemistry    88
dtype: int64

DataFrame in Pandas

In [12]:
data={"Name": ["Aman","krish","karan"],
      "Age":[20,22,25],
      "Marks":[90,85,88]}

In [14]:
print(data)

{'Name': ['Aman', 'krish', 'karan'], 'Age': [20, 22, 25], 'Marks': [90, 85, 88]}

In [15]:
type(data)

dict

In [16]:
marks=pd.DataFrame(data)

In [17]:
print(marks)

    Name  Age  Marks
0   Aman   20     90
1  krish   22     85
2  karan   25     88

In [18]:
#we can also add custom index in pandas dataframe
marks=pd.DataFrame(data,index=['Student1','Student2','Student3'])

In [19]:
print(marks)

           Name  Age  Marks
Student1   Aman   20     90
Student2  krish   22     85
Student3  karan   25     88

In [20]:
marks.set_index('Name',inplace=True) #if we are setting iplace=True it means we are changing the original object itself
print(marks)

       Age  Marks
Name
Aman    20     90
krish   22     85
karan   25     88

In [21]:
dp=pd.DataFrame({"Name":["Saurav","Karan","Aman"],"Age":[22,23,21],"Marks":[85,90,88]})
print(dp)

     Name  Age  Marks
0  Saurav   22     85
1   Karan   23     90
2    Aman   21     88

In [22]:
dp.head() #print first 5 rows

     Name  Age  Marks
0  Saurav   22     85
1   Karan   23     90
2    Aman   21     88

In [23]:
dp.tail() #print last 5 rows

     Name  Age  Marks
0  Saurav   22     85
1   Karan   23     90
2    Aman   21     88

In [24]:
df=pd.DataFrame({"Name":["Saurav","Karan","Aman","Subham","abhishek","rahul"],"Age":[22,23,21,24,25,26],"Marks":[85,90,88,92,87,95]})
print(df)

       Name  Age  Marks
0    Saurav   22     85
1     Karan   23     90
2      Aman   21     88
3    Subham   24     92
4  abhishek   25     87
5     rahul   26     95

In [25]:
df.head(2) #print first 2 rows

     Name  Age  Marks
0  Saurav   22     85
1   Karan   23     90

In [26]:
df.tail(2) #print last 2 rows

       Name  Age  Marks
4  abhishek   25     87
5     rahul   26     95

In [27]:
df.shape        #gives number of rows and columns in dataframe

(6, 3)

In [28]:
df.columns      #gives the name of columns in dataframe

Index(['Name', 'Age', 'Marks'], dtype='str')

In [29]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      str
 1   Age     6 non-null      int64
 2   Marks   6 non-null      int64
dtypes: int64(2), str(1)
memory usage: 276.0 bytes

In [30]:
df.describe()

             Age      Marks
count   6.000000   6.000000
mean   23.500000  89.500000
std     1.870829   3.619392
min    21.000000  85.000000
25%    22.250000  87.250000
50%    23.500000  89.000000
75%    24.750000  91.500000
max    26.000000  95.000000

Selecting the data

In [31]:
df["Name"]

0      Saurav
1       Karan
2        Aman
3      Subham
4    abhishek
5       rahul
Name: Name, dtype: str

In [32]:
df[["Name","Marks"]]

       Name  Marks
0    Saurav     85
1     Karan     90
2      Aman     88
3    Subham     92
4  abhishek     87
5     rahul     95

Filtering in pandas

In [33]:
df[df["Marks"]>85]#gives the rows where marks are greater than 85

       Name  Age  Marks
1     Karan   23     90
2      Aman   21     88
3    Subham   24     92
4  abhishek   25     87
5     rahul   26     95

In [34]:
df[(df["Marks"]>90) & (df["Age"]>22)] #gives the rows where marks are greater than 90 and age is greater than 22

     Name  Age  Marks
3  Subham   24     92
5   rahul   26     95

In [35]:
df.sort_values("Marks") #it will sort the dataframe based on marks in ascending order

       Name  Age  Marks
0    Saurav   22     85
4  abhishek   25     87
2      Aman   21     88
1     Karan   23     90
3    Subham   24     92
5     rahul   26     95

In [36]:
df.sort_values("Marks",ascending=False) #sort the dataframe based on marks in descending order

       Name  Age  Marks
5     rahul   26     95
3    Subham   24     92
1     Karan   23     90
2      Aman   21     88
4  abhishek   25     87
0    Saurav   22     85

In [37]:
df["Age"].value_counts() #gives the count of unique values in age column

Age
22    1
23    1
21    1
24    1
25    1
26    1
Name: count, dtype: int64

Handling missing values

In [38]:
#updating the dataset with null values

df=pd.DataFrame({"Name":["Saurav","Karan","Aman","Subham","abhishek","rahul"],
                 "Age":[22,23,21,24,25,26],
                 "Marks":[85,90,88,92,87,95]
                 })
df

       Name  Age  Marks
0    Saurav   22     85
1     Karan   23     90
2      Aman   21     88
3    Subham   24     92
4  abhishek   25     87
5     rahul   26     95

In [39]:
df.isnull() #gives true for null values and false for non null values

    Name    Age  Marks
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False

In [40]:
df.isnull().sum() #gives the count of null values in each column

Name     0
Age      0
Marks    0
dtype: int64

In [41]:
df.dropna() #it will drop the rows with null values

       Name  Age  Marks
0    Saurav   22     85
1     Karan   23     90
2      Aman   21     88
3    Subham   24     92
4  abhishek   25     87
5     rahul   26     95